<?php
/**
 * 错误提示配置文件
 */

return [
    /*成功提示*/
    '200' => '成功',

    /*系统级别错误*/
    '10000' => '错误',
    '10001' => '参数错误',
    '10002' => '系统错误',
    '10003' => '数据库更新错误',
    '10004' => '路由不存在',
    '10005' => '语言参数错误',
    '10006' => '不允许的文件类型',
    '10007' => '上传失败',
    '10008' => '邮件发送失败',

    /*访问级别*/
    '10100' => '请先登录',
    '10101' => 'token错误或已过期',
    '10102' => '登录用户名或密码错误',
    '10103' => '没有操作权限',

    /*用户管理*/
    '10110' => '登录账号已存在',
    '10111' => '用户不存在',
    '10112' => '添加用户失败',
    '10113' => '删除用户失败',
    '10114' => '编辑用户失败',
    '10115' => '登录账号长度为3-20位',
    '10116' => '两次输入的密码不一致',
    
];
